pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.PA */
#define IFX_GETH_MAC_MDIO_ADDRESS_PA_MSK (0x1fu)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.PA */
#define IFX_GETH_MAC_MDIO_ADDRESS_PA_OFF (21u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.BTB */
#define IFX_GETH_MAC_MDIO_ADDRESS_BTB_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.BTB */
#define IFX_GETH_MAC_MDIO_ADDRESS_BTB_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.BTB */
#define IFX_GETH_MAC_MDIO_ADDRESS_BTB_OFF (26u)

/** \brief Length for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.PSE */
#define IFX_GETH_MAC_MDIO_ADDRESS_PSE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.PSE */
#define IFX_GETH_MAC_MDIO_ADDRESS_PSE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_MDIO_ADDRESS_Bits.PSE */
#define IFX_GETH_MAC_MDIO_ADDRESS_PSE_OFF (27u)

/** \brief Length for Ifx_GETH_MAC_MDIO_DATA_Bits.GD */
#define IFX_GETH_MAC_MDIO_DATA_GD_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_DATA_Bits.GD */
#define IFX_GETH_MAC_MDIO_DATA_GD_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_MDIO_DATA_Bits.GD */
#define IFX_GETH_MAC_MDIO_DATA_GD_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_MDIO_DATA_Bits.RA */
#define IFX_GETH_MAC_MDIO_DATA_RA_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_MDIO_DATA_Bits.RA */
#define IFX_GETH_MAC_MDIO_DATA_RA_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_MDIO_DATA_Bits.RA */
#define IFX_GETH_MAC_MDIO_DATA_RA_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_CSR_SW_CTRL_Bits.RCWE */
#define IFX_GETH_MAC_CSR_SW_CTRL_RCWE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CSR_SW_CTRL_Bits.RCWE */
#define IFX_GETH_MAC_CSR_SW_CTRL_RCWE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CSR_SW_CTRL_Bits.RCWE */
#define IFX_GETH_MAC_CSR_SW_CTRL_RCWE_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_CSR_SW_CTRL_Bits.SEEN */
#define IFX_GETH_MAC_CSR_SW_CTRL_SEEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CSR_SW_CTRL_Bits.SEEN */
#define IFX_GETH_MAC_CSR_SW_CTRL_SEEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CSR_SW_CTRL_Bits.SEEN */
#define IFX_GETH_MAC_CSR_SW_CTRL_SEEN_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_EXT_CFG1_Bits.SPLOFST */
#define IFX_GETH_MAC_EXT_CFG1_SPLOFST_LEN (7u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CFG1_Bits.SPLOFST */
#define IFX_GETH_MAC_EXT_CFG1_SPLOFST_MSK (0x7fu)

/** \brief Offset for Ifx_GETH_MAC_EXT_CFG1_Bits.SPLOFST */
#define IFX_GETH_MAC_EXT_CFG1_SPLOFST_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_EXT_CFG1_Bits.SPLM */
#define IFX_GETH_MAC_EXT_CFG1_SPLM_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_EXT_CFG1_Bits.SPLM */
#define IFX_GETH_MAC_EXT_CFG1_SPLM_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_EXT_CFG1_Bits.SPLM */
#define IFX_GETH_MAC_EXT_CFG1_SPLM_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.ADDRHI */
#define IFX_GETH_MAC_ADDRESS_HIGH0_ADDRHI_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.ADDRHI */
#define IFX_GETH_MAC_ADDRESS_HIGH0_ADDRHI_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.ADDRHI */
#define IFX_GETH_MAC_ADDRESS_HIGH0_ADDRHI_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.DCS */
#define IFX_GETH_MAC_ADDRESS_HIGH0_DCS_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.DCS */
#define IFX_GETH_MAC_ADDRESS_HIGH0_DCS_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.DCS */
#define IFX_GETH_MAC_ADDRESS_HIGH0_DCS_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.AE */
#define IFX_GETH_MAC_ADDRESS_HIGH0_AE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.AE */
#define IFX_GETH_MAC_ADDRESS_HIGH0_AE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_HIGH0_Bits.AE */
#define IFX_GETH_MAC_ADDRESS_HIGH0_AE_OFF (31u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_LOW0_Bits.ADDRLO */
#define IFX_GETH_MAC_ADDRESS_LOW0_ADDRLO_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_LOW0_Bits.ADDRLO */
#define IFX_GETH_MAC_ADDRESS_LOW0_ADDRLO_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_LOW0_Bits.ADDRLO */
#define IFX_GETH_MAC_ADDRESS_LOW0_ADDRLO_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.ADDRHI */
#define IFX_GETH_MAC_ADDRESS_HIGH_ADDRHI_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.ADDRHI */
#define IFX_GETH_MAC_ADDRESS_HIGH_ADDRHI_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.ADDRHI */
#define IFX_GETH_MAC_ADDRESS_HIGH_ADDRHI_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.DCS */
#define IFX_GETH_MAC_ADDRESS_HIGH_DCS_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.DCS */
#define IFX_GETH_MAC_ADDRESS_HIGH_DCS_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.DCS */
#define IFX_GETH_MAC_ADDRESS_HIGH_DCS_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.MBC */
#define IFX_GETH_MAC_ADDRESS_HIGH_MBC_LEN (6u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.MBC */
#define IFX_GETH_MAC_ADDRESS_HIGH_MBC_MSK (0x3fu)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.MBC */
#define IFX_GETH_MAC_ADDRESS_HIGH_MBC_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.SA */
#define IFX_GETH_MAC_ADDRESS_HIGH_SA_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.SA */
#define IFX_GETH_MAC_ADDRESS_HIGH_SA_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.SA */
#define IFX_GETH_MAC_ADDRESS_HIGH_SA_OFF (30u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.AE */
#define IFX_GETH_MAC_ADDRESS_HIGH_AE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.AE */
#define IFX_GETH_MAC_ADDRESS_HIGH_AE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_HIGH_Bits.AE */
#define IFX_GETH_MAC_ADDRESS_HIGH_AE_OFF (31u)

/** \brief Length for Ifx_GETH_MAC_ADDRESS_LOW_Bits.ADDRLO */
#define IFX_GETH_MAC_ADDRESS_LOW_ADDRLO_LEN (32u)

/** \brief Mask for Ifx_GETH_MAC_ADDRESS_LOW_Bits.ADDRLO */
#define IFX_GETH_MAC_ADDRESS_LOW_ADDRLO_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_MAC_ADDRESS_LOW_Bits.ADDRLO */
#define IFX_GETH_MAC_ADDRESS_LOW_ADDRLO_OFF (0u)

/** \brief Length for Ifx_GETH_MMC_CONTROL_Bits.CNTRST */
#define IFX_GETH_MMC_CONTROL_CNTRST_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_CONTROL_Bits.CNTRST */
#define IFX_GETH_MMC_CONTROL_CNTRST_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_CONTROL_Bits.CNTRST */
#define IFX_GETH_MMC_CONTROL_CNTRST_OFF (0u)

